//******************************************************************************
// Секция include: здесь подключается заголовочный файл к модулю
#include "Lib_A_CRC_cyclic_redundancy_check.h"
//******************************************************************************


//******************************************************************************
//------------------------------------------------------------------------------
// Глобальные переменные
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
// Локальные переменные
//------------------------------------------------------------------------------
//******************************************************************************


//******************************************************************************
// Секция прототипов локальных функций
//******************************************************************************


//******************************************************************************
// Секция описания функций (сначала глобальных, потом локальных)
//==============================================================================

/**
 *  @brief  Фукнция выполняет расчет 8-vи битной контрольной суммы массива данных;
 *  @param  *pArr:  Указатель на элемент массива, с которого необходимо начать 
 *                  расчет контрольной суммы;
 *  @param  len: Количество байт, участвующих в расчете контрольной суммы;
 *  @retval Рассчитанная 8-ми битная контрольная сумма массива данных;
 */
uint8_t CRC_XOR_Crc8(uint8_t *pArr, uint16_t len)
{
    size_t i;
    uint8_t crc = 0;
    for (i = 0; i < len; i++)
    {
        crc ^= *pArr++;
    }
    return crc;
}

/**
 *  @brief  Фукнция выполняет расчет 16-ти битной контрольной суммы массива данных;
 *  @param  *pArr:  Указатель на элемент массива, с которого необходимо начать 
 *                  расчет контрольной суммы;
 *  @param  len: Количество байт, участвующих в расчете контрольной суммы;
 *  @retval Рассчитанная 16-ти битная контрольная сумма массива данных;
 * @see https://ru.wikibooks.org/wiki/%D0%A0%D0%B5%D0%B0%D0%BB%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D0%B8_%D0%B0%D0%BB%D0%B3%D0%BE%D1%80%D0%B8%D1%82%D0%BC%D0%BE%D0%B2/%D0%A6%D0%B8%D0%BA%D0%BB%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9_%D0%B8%D0%B7%D0%B1%D1%8B%D1%82%D0%BE%D1%87%D0%BD%D1%8B%D0%B9_%D0%BA%D0%BE%D0%B4#CRC-16
 */
uint16_t CRC_XOR_CCITT_Poly0x1021_Crc16(uint8_t *pArr,
                                        uint16_t len)
{
    size_t i;
    uint16_t crc = 0xFFFF;

    while (len--)
    {
        crc ^= *pArr++ << 8;

        for (i = 0; i < 8; i++)
        {
            crc = crc & 0x8000 ? (crc << 1) ^ 0x1021 : crc << 1;
        }
    }
    return crc;
}

//==============================================================================
//******************************************************************************


//******************************************************************************
// END OF FILE
//******************************************************************************